---
title: "Simple Example Dataframes In pandas"
author: "Chris Albon"
date: 2017-12-20T11:53:49-07:00
description: "Simple example dataframes in pandas."
type: technical_note
draft: false
---

### import modules

In [1]:
import pandas as pd

### Create dataframe

In [2]:
raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'], 
        'age': [42, 52, 36, 24, 73], 
        'preTestScore': [4, 24, 31, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'preTestScore', 'postTestScore'])
df

  first_name last_name  age  preTestScore  postTestScore
0      Jason    Miller   42             4             25
1      Molly  Jacobson   52            24             94
2       Tina       Ali   36            31             57
3       Jake    Milner   24             2             62
4        Amy     Cooze   73             3             70

### Create 2nd dataframe

In [3]:
raw_data_2 = {'first_name': ['Sarah', 'Gueniva', 'Know', 'Sara', 'Cat'], 
        'last_name': ['Mornig', 'Jaker', 'Alom', 'Ormon', 'Koozer'], 
        'age': [53, 26, 72, 73, 24], 
        'preTestScore': [13, 52, 72, 26, 26],
        'postTestScore': [82, 52, 56, 234, 254]}
df_2 = pd.DataFrame(raw_data_2, columns = ['first_name', 'last_name', 'age', 'preTestScore', 'postTestScore'])
df_2

  first_name last_name  age  preTestScore  postTestScore
0      Sarah    Mornig   53            13             82
1    Gueniva     Jaker   26            52             52
2       Know      Alom   72            72             56
3       Sara     Ormon   73            26            234
4        Cat    Koozer   24            26            254

### Create 3rd dataframe

In [4]:
raw_data_3 = {'first_name': ['Sarah', 'Gueniva', 'Know', 'Sara', 'Cat'], 
        'last_name': ['Mornig', 'Jaker', 'Alom', 'Ormon', 'Koozer'],
         'postTestScore_2': [82, 52, 56, 234, 254]}
df_3 = pd.DataFrame(raw_data_3, columns = ['first_name', 'last_name', 'postTestScore_2'])
df_3

  first_name last_name  postTestScore_2
0      Sarah    Mornig               82
1    Gueniva     Jaker               52
2       Know      Alom               56
3       Sara     Ormon              234
4        Cat    Koozer              254